Revit 2027 API
LoadCombination.State Property
 The state of the load combination.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LoadCombinationState State { get; set; }
Public Property State As LoadCombinationState
	Get
	Set
public:
property LoadCombinationState State {
	LoadCombinationState get ();
	void set (LoadCombinationState value);
}
member State : LoadCombinationState with get, set
Property Value
LoadCombinationState
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace